package com.aims.core.exception;

/**
 * 公用错误码
 */
public enum CommonErrorCode implements ErrorCode{
    E0("0","成功"),

    // 通用错误信息
    E100000("100000", "系统异常，请稍后再试"),
    E100001("100001", "请求参数异常"),
    E100002("100002", "根据请求参数获取不到数据"),
    E100003("100003", "不符合业务逻辑"),
    E100004("100004", "无效的状态"),
    E100005("100005", "网络出错"),
    E100006("100006", "数据已存在"),
    E100007("100007","上传文件格式不正确"),
    E100008("100008","上传文件内容不正确"),
    E100099("100099","登陆失效，请重新登录"),
    E100010("100010","无效的请求方式"),
    E100011("100011","请求token为空"),
    E100012("100012","请求token已过期"),
    E100013("100013","接口调用出错"),
    E100014("100014","登录认证失败"),
    E100015("100015","无效的token信息"),
    E100016("100016","无操作权限"),

    //系统模块：E200000 开始
    E200000("200000","该监护仪不存在"),
    E200001("200001","请选择已有的监护仪"),
    E200002("200002","该呼吸机不存在"),
    E200003("200003","请选择呼吸机"),


    //患者模块：E300000 开始
    E300000("300000","患者不存在"),
    E300001("300001","患者入科信息不存在"),
    E300002("300002","住院编号不存在"),
    E300003("300003","患者信息不存在"),
    E300004("300004","患者已入科"),
    E300005("300005","Icu已有患者"),
    E300006("300006","患者已出科"),
    E300007("300007","该患者已有监护仪请先取消绑定"),
    E300008("300008","该患没有监护仪"),
    E300009("300009","该患者没有配置呼吸机"),
    E300010("300010","该患者已有呼吸机请先取消绑定"),
    E300011("300011","该患没有呼吸机"),
    E300012("300012","没有交班记录"),
    E300013("300013","该患者icu没有入科"),
    E300014("300014","请选择正确患者"),
    E300015("300015"," 入院时间必须早于等于入科时间"),
    E300016("300016"," 入科时间必须早于等于记录单开始时间"),
    E300017("300017"," 入院时间 必须早于等于记录单开始时间"),
    E300018("300018","开始年龄小于结束年龄"),
    E300019("300019","无患者更新"),
    E300020("300020", "该患者在HIS中未出科"),

        //床位模块：E400000 开始
    E400000("400000","床头号为空"),
    E400001("400001","患者床位不存在"),
    E400002("400002","床位已经满了"),
    E400003("400003","该床位已有患者"),
    E400004("400004","请选择床位"),
    E400005("400005","没有该床位"),
    E400006("400006","该患者已有呼吸机请先取消绑定"),
    E400007("400007","该床已经有其他监护仪请先取消绑定"),
    E400008("400008","监护仪被其他床绑定请先取消绑定"),

    //医嘱模块：E500000 开始
    E500000("500000","查询日期不能为空"),
    E500001("500001","患者ID不能为空"),
    E500002("500002","住院号不能为空"),
    E500003("500003","日期格式异常，请按yyyy-MM-dd"),
    E500004("500004","班次ID不能为空"),
    E500005("500005","该班次不存在"),
    E500006("500006","请选择医嘱信息"),
    E500007("500007","保存日期不能为空"),
    E500008("500008","执行时间需在0-23之间"),
    E500009("500009","该医嘱已经完成或交班，不可以修改医嘱信息"),
    E500010("500010","总剂量必须大于等于零"),
    E500011("500011","执行量不能为空"),
    E500012("500012","执行时间不能为空"),
    E500013("500013","该时间点不是本班次时间，不能插入"),
    E500014("500014","该时间点已存在记录，请先刷新界面数据"),
    E500015("500015","执行编号不能为空"),
    E500016("500016","该医嘱不存在或被删除"),
    E500017("500017","该医嘱信息已经完成，请先取消完成"),
    E500018("500018","该医嘱信息已经交班，请先取消交班"),
    E500019("500019","请选择要删除的分类"),
    E500020("500020","请选择要更新的医嘱分类"),
    E500021("500021","医嘱未交班，不能取消，请确认"),
    E500022("500022","医嘱交班后已经有执行记录，请先删除执行记录再取消交班"),
    E500023("500023","该医嘱已被提取，不能更新执行时间"),
    E500024("500024","该医嘱未被提取，不能操作"),
    E500025("500025","当前班次日期已经交班，请先切换到交班后的日期再操作该条医嘱"),
    E500026("500026","操作失败，该医嘱不是完成状态，请确认"),
    E500027("500027","操作失败，该医嘱已存在执行记录，请先删除"),
    //护理模块：E600000 开始
    E600000("600000","名称%s%已经存在，请重新录入"),
    E600001("600001","请选择护理模板"),
    E600002("600002","该护理模板不存在或已删除"),
    //护理模块：E700000 开始
    //统计模块：E800000 开始
    //角色模块：E900000 开始
    E900000("900000","角色code不存在"),
    E900001("900001","该角色正在使用中不能删除"),
    ;

    CommonErrorCode(String code,String message){
        this.code = code;
        this.message = message;
    }

    private String code;

    private String message;

    @Override
    public String getCode() {
        return code;
    }

    @Override
    public String getMsg() {
        return message;
    }

    @Override
    public void setCode(String code) {
        this.code = code;
    }

    @Override
    public void setMsg(String msg) {
        this.message = msg;
    }
}
